---
kind: type
id: T:Autodesk.Revit.DB.ModelText
source: html/3a51d58c-3e29-b641-e8bb-4d8a17c31527.htm
---
# Autodesk.Revit.DB.ModelText

A model text element in an Autodesk Revit family document.

## Syntax (C#)
```csharp
public class ModelText : Element
```

## Remarks
Inheritance Hierarchy System.Object    Autodesk.Revit.DB.Element      Autodesk.Revit.DB.ModelText